//////////////////////////////////////////////////////////////////////////////////
//  Design by GRish!                                                 23/04/2019
//
//  Сопоставление платежей и дел

&AtServer
Процедура ПриОткрытииServer()
	
	Items.СписокПоказатьВсех.Visible = Список.Filter.Items.Count()>0;
	
КонецПроцедуры

&AtServer
Процедура ПоказатьВсехServer()
	
	Список.Filter.Items.Clear();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////
//  обработчики событий формы
//

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//thisobject.Параметры.Отбор.Контрагент
	if  thisobject.Параметры.property("ПлательщикСтрокой", ПлательщикСтрокой)  then
		
	else
		Items.СписокПоиск.Visible = false;
	endif;
	//пусто, отбор еще не установлен
	//Items.СписокПоказатьВсех.Visible = Список.Filter.Items.Count()>0;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииServer();
КонецПроцедуры

////////////////////////////////////////////////////////////////////
//    Команды формы
//

&НаКлиенте
Процедура ПоказатьВсех(Команда)
	
	ПоказатьВсехServer();
	
КонецПроцедуры

