
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	Поля.Add("Наименование");
	Поля.Add("Представление");
	СтандартнаяОбработка = false;
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	if Данные.Представление<>"" then
		Представление = Данные.Представление;
	else  
		Представление = Данные.Наименование;
	endif;
	
	СтандартнаяОбработка = false;
КонецПроцедуры

procedure ЗаполнитьСправочник() export
	objФизЛицо=Справочники.ЮрФиз.ФизЛицо.GetObject();
	objФизЛицо.Представление = "ФЛ";
	objФизЛицо.Write();
	
	objФизЛицо=Справочники.ЮрФиз.ЮрЛицо.GetObject();
	objФизЛицо.Представление = "ЮЛ";
	objФизЛицо.Write();

endprocedure	