
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	Поля.Add("Номер");
	Поля.Add("Дата");
	Поля.Add("Сумма");
	Поля.Add("Плательщик");
	Поля.Add("ПлательщикСтрокой");
	Поля.Add("НазначениеПлатежа");
	СтандартнаяОбработка = false;
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Представление = "Платеж №"+Данные.Номер + " от " + Format(Данные.Дата, "ДФ=dd.MM.yyyy") 
		+ " ="+ Format(Данные.Сумма, "ЧРД=.; ЧГ=0") 
		+  "руб. " + ?(ValueIsFilled(Данные.Плательщик), Данные.Плательщик, Данные.ПлательщикСтрокой)
		+ ?(StrLen(Данные.НазначениеПлатежа)>0,":"+Данные.НазначениеПлатежа, "");
		
	СтандартнаяОбработка = false;
КонецПроцедуры
